Revit 2027 API
StructuralConnectionHandler.GetConnectedElementIds Method
 Retrieves list of element ids of connected elements.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetConnectedElementIds()
Public Function GetConnectedElementIds As IList(Of ElementId)
public:
IList<ElementId^>^ GetConnectedElementIds()
member GetConnectedElementIds : unit -> IList<ElementId>
Return Value
IList<ElementId>
 Returns connected element ids.
See Also
Reference
StructuralConnectionHandler Class
Autodesk.Revit.DB.Structure Namespace